Revit 2027 API
AnalyticalLoopType Enumeration
 Specifies kind of analytical model loop.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum AnalyticalLoopType
Public Enumeration AnalyticalLoopType
public enum class AnalyticalLoopType
type AnalyticalLoopType
Members
Member name | Value | Description
All | 0 |  All analytical loops of analytical model surface elements (floor, slab, wall).
External | 1 |  Loops outside all other loops. In case of multiple nested loops, this will return the most external loop.
Filled | 3 |  Loops that are filled inside. In the case of multiple nested loops, this will return the most external and every second loop going from external to internal. In the view, returned loops are presented as external outline of solids.
Internal | 2 |  An internal loop is a loop that is inside another loop. In the case of multiple nested loops, this will return all loops except the most external loop.
Void | 4 |  Loops that are empty inside. In the case of multiple nested loops, this will return a series of loops starting from second most external and every second heading into the most internal. In the view returned loops are presented as external outline of openings.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace